In [1]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101) #To make sure we get the same random number as the course instructor.In this case the 101th random number. if we change seed number random number will be different

In [92]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [93]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

### Each of the column is basically a pandas series. Thus W is a pandas series, as well as X, Y and Z.

### Let's see how to index and select one of these series objects

In [7]:
df['W'] # If you see the output, it will look like a series. and that's what a 'W' column is.

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [9]:
type(df['W']) #See that df['W'] is a series

pandas.core.series.Series

In [10]:
type(df) # To summarize, Dataframe is just a bunch of series

pandas.core.frame.DataFrame

In [11]:
df[['W','Z']] #If you want to get multiple columns, you need to mention a list of columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [25]:
df['new'] = df['W'] + df['Y'] #To create a new column in a dataframe

In [14]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [16]:
df.drop('new',axis=1)    #To remove a column you have to specify axis=1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
#df.drop doesn't actually removes the column

In [18]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [19]:
#To actually remove the column from the dataframe you have to pass another parameter inplace=True

In [26]:
df.drop('new',axis=1,inplace=True) #Pandas does this so that you don't accidentally lose valuable information that you've worked with

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
#Now let's drop a row

In [29]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [39]:
df.shape

(5, 4)

In [40]:
#SELECTING ROWS

In [44]:
df.loc['A'] #Notice that we get row 'A' in form of series. Thus, not only DataFrame columns are Series, but also the row are Series.

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

#### Numerical based indexing of row in Pandas: iloc

In [43]:
df.iloc[2] #Even if rows are indexed using strings, we can access them by index numbers using iloc

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [46]:
df.loc['B','Y'] #Accessing a single value in a dataframe

-0.8480769834036315

In [47]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df.loc[['A','B'],['W','Y']] #To access a subset of rows and columns from the dataframe

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

#### Below: Conditional Selection for DataFrames

In [50]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [53]:
booldf = df > 0

In [54]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [56]:
df[booldf] # We get values where it is true and NaN where the condition is false

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df[df>0] #same result, but done in one step, instead of two steps here we do it in one step

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
df['W']>0 #From the series, we see the condition does not hold true for row 'C'

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

#### Filter out rows, for which 'W'>0 condition holds True. Will be used very often

In [61]:
df[df['W']>0] #Using this condition, We'll get all the data except row 'C' because for row 'C' the condition stands FALSE

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [66]:
resultdf = df[df['W']>0]

In [67]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [71]:
df[df['W']>0]['X'] #Doing it one step so that  we do not have to copy DataFrame to resultdf

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [74]:
df[df['W']>0][['Y','X']] #Getting multiple columns from the resulting DataFrame

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [76]:
#Let's break down the complex code we wrote in the previous segment
boolser = df['W']>0
result = df[boolser]
mycols = ['Y','X']
result[mycols]
#If you don't understand the one liner complex code, break it down to segments like this. But this will cost you more memory. Thus, throughout the course we will mostly be using one liners

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [77]:
df[(df['W']>0) and (df['Y']>1)] #This will produce error because Python and can only take account for two boolean values at a time. For ex: True and False = False. But here we have to deal with multiple instances of boolean, thus you need to use &

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [78]:
df[(df['W']>0) & (df['Y']>1)] #Correct way of 'and' logic on dataframes

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [79]:
#Correct way of using 'or' logic you need to use |. Example below

In [80]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [81]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [82]:
#Resetting index to something else or normal 0,1,2,3,4,...nth row fromat

In [90]:
df.reset_index() #index is reset to 0,1,2,3,4 and a seperate column has been created namely index to old index names

   level_0 index         W         X         Y         Z
0        0     A  2.706850  0.628133  0.907969  0.503826
1        1     B  0.651118 -0.319318 -0.848077  0.605965
2        2     C -2.018168  0.740122  0.528813 -0.589001
3        3     D  0.188695 -0.758872 -0.933237  0.955057
4        4     E  0.190794  1.978757  2.605967  0.683509

In [89]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [ ]:
#To permenantly do it you need to specify inplace=True

In [86]:
df.reset_index(inplace=True)

In [94]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [95]:
newind = 'CA NY WY OR CO'.split() #Quick way of creating a list using split()

In [96]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [97]:
df['States'] = newind #as the dimensions math and we have 5 items thus a new column will be added to df DataFrame

In [98]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [99]:
df.set_index('States') #Now the dataframe will be indexed using the States column. inplace=True to make it permanent

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [100]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [101]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [102]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [103]:
inside

[1, 2, 3, 1, 2, 3]

In [104]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [105]:
# Dont worry about pd.MultiIndex.from_tuples. It wont be used much in this course. Just for you to know it creates multilevel index

In [106]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B']) #Dataframe of random numbers of size 6x2. We've used the hier_index that we created. And column names set to 'A' and 'B'

In [108]:
df #We will see two level of index. Otherwise known as index hierarchy

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

### Below: Indexing method in index hierarchy

In [110]:
df.loc['G1'] #To get everthing under index G1

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [112]:
df.loc['G1'].loc[1] #To get everthing under index G1 and subindex 1

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [113]:
df.index.names #No name assigned for the indexes

FrozenList([None, None])

In [114]:
df.index.names = ['Groups','Num']  #To name the indexes

In [118]:
df.loc['G2'].loc[2]['B'] #To access a specific value in the dataframe in index hierarchy

-0.6102588558227414

In [120]:
df #Lets select another value -0.610259

                   A         B
Groups Num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [121]:
df.xs(1,level='Num') #To get cross sections of the dataframe. Here we retreive rows of Num index 1 for both G1 and G2. For this sort of cross section retrieval of data xs is used

               A         B
Groups
G1     -0.993263  0.196800
G2     -0.031579  0.649826